{
    "projects": [
        {
            "Name": "<a href='https://github.com/braynguyen/The-Social-Space'>The Social Space</a>",
            "Tagline": "Full-Stack Data Visualization",
            "About": "In this project, we graphically represented TikTok's social media algorithm with an interactive and intuitive Three.js and WebGL 3d graph. To do this, we web scraped 300,000+ TikTok videos for hashtags into a tabular file and built a custom weighted graph data structure to store the data. Then, we used Louvain method with NetworkX to color similar hashtag clusters.",
            "Tags": [
                "AWS",
                "Three.js",
                "WebGL"
            ]
        },
        {
            "Name": "<a href='https://github.com/braynguyen/MediLingual'>MediLingual</a>",
            "Tagline": "1st  Place Healthcare Hack @YHack 2024",
            "About": "MediLingual is a universal assistant which provides medical domain-specific multilingual translation services in 99 different languages.<br /><br />It uses a Flask REST API that handles any combination of 4581 to ease translation between patient and doctor in real time and Whisper and OpenAI API with few-shot and chain-of-thought prompting to remove any untranslatable medical jargon.",
            "Tags": [
                "AI",
                "Flask",
                "LLMs"
            ]
        },
        {
            "Name": "<a href='https://github.com/braynguyen/TDMA-Forwarding'>TDMA-Forwarding</a>",
            "Tagline": "TDMA-based Routing Protocol Implementation",
            "About": "An implementation of the TDMA-based routing protocol from the paper \"Routing in Mobile Cyber-Physical Systems\" by Luis Oliveira & Luis Almeida. This C implementation using Docker containers demonstrates synchronized multi-hop message routing where nodes can forward messages within the sender's time slot, enabling efficient relay communication across a network topology.",
            "Tags": [
                "C",
                "Docker",
                "Routing"
            ]
        },
        {
            "Name": "<a href='https://github.com/braynguyen/AeroVision'>Aerovision</a>",
            "Tagline": "1st  Place Healthcare Hack @YHack 2024",
            "About": "Through the use of OpenCV's computer vision libraries we created a script to recognize air martial signals to control a Viam robot with just hand gestures.<br /><br />This project targets the period of time where both self driving and manually driven aircrafts are in use, allowing for a more seamless transition",
            "Tags": [
                "OpenCV",
                "Robotics"
            ]
        },
        {
            "Name": "<a href='https://github.com/braynguyen/ASLModel'>ASLModel</a>",
            "Tagline": "1st Place Overall @ SteelHacks 2023",
            "About": "ASLModel is a custom CV model that automatically translates ASL to English. We trained this model from 25,000 hand images displaying ASL signs.<br /><br />My role in this project was to create an accessible interface via a web-app with React components that can take input from the webcam and continuously integrate user training data for model improvement. ",
            "Tags": [
                "TensorFlow",
                "OpenCV",
                "React"
            ]
        },
        {
            "Name": "<a href='https://github.com/braynguyen/Lyric-Scraper'>Song Lyrics Scraper</a>",
            "Tagline": "Genius Scraper",
            "About": "Created a scraper and store all of the lyrics for all songs of any given artist from the Genius website (you would think the API would have it). This project utilized Python's Beautiful Soup package.<br /><br />This is a WIP of a full project to create a lyric generator for a game to guess whether the artist wrote the lyric or not.",
            "Tags": [
                "BS4",
                "Web Scraping"
            ]
        },
        {
            "Name": "<a href='https://github.com/braynguyen/twit-results'>Smash Bros Tournament Results Poster</a>",
            "Tagline": "Tournament to Twitter Post",
            "About": "Connected the Twitter API with the Start.gg API in JavaScript to post the results of any esports tournament on Start.gg directly to twitter with formatting.<br /><br />Amassed 1700+ views for the Delaware Smash Bros scene and was my first project using APIs.",
            "Tags": [
                "APIs"
            ]
        }
    ]
}